In [2]:
import pandas as pd
import numpy as np

# 실습

## 문제1

In [49]:
df = pd.read_csv("./data/movie_ratings.csv")
print(df.shape)
df.head()

(500, 6)

   UserID  MovieID  Rating  Age  Occupation    Genre
0      45        8       4   55  Unemployed   Horror
1      48        5       3   15    Engineer   Action
2      65        4       2   55     Student  Romance
3      68        6       5   45      Doctor   Comedy
4      68        7       4   25    Engineer  Romance

In [50]:
print(df['Age'].mean())
print(df['Age'].min())
print(df['Age'].max())

38.52
15
60

In [51]:
print(df['Rating'].describe())

count    500.000000
mean       2.998000
std        1.434612
min        1.000000
25%        2.000000
50%        3.000000
75%        4.000000
max        5.000000
Name: Rating, dtype: float64

In [52]:
# df.mode().iloc[:,[1]]
df.mode()

   UserID  MovieID  Rating  Age Occupation    Genre
0       1        6       1   30     Artist  Romance

In [53]:
df['MovieID'].value_counts().to_frame().reset_index().iloc[[0]]

   MovieID  count
0        6     40

## 문제 2

In [26]:
df = pd.read_csv('./data/auto-mpg.csv')
print(df.shape)
df.head()

(398, 9)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [30]:
df_70 = df.loc[(df['model year']>=70)&(df['model year']<80)]
df_70['mpg'].mean()

21.096763754045305

In [32]:
df_low = df.loc[df['horsepower']<df['horsepower'].mean()]
df_low['mpg'].mean()

27.542

In [33]:
df_high = df.loc[df['horsepower']>df['horsepower'].mean()]
df_high['mpg'].mean()

16.71148648648649

In [37]:
df.loc[
    (df['weight'] == df['weight'].max())|
    (df['weight'] == df['weight'].min())
][['mpg']]

     mpg
44  13.0
54  35.0